# Parameters
nc: 23  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales convolution channels

backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 48]]                                  # 0
  - [-1, 6, HGBlock, [48, 128, 3]]                             # 1
  - [-1, 1, DWConv, [128, 3, 2, 1, False]]                     # 2
  - [-1, 6, HGBlock, [96, 512, 3]]                             # 3
  - [-1, 1, DWConv, [512, 3, 2, 1, False]]                     # 4
  - [-1, 6, HGBlock, [192, 1024, 5, True, False]]              # 5
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]               # 6
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]               # 7
  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]                    # 8
  - [-1, 6, HGBlock, [384, 2048, 5, True, False]]              # 9

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]              # 10

    # ---------- HSA -----------
  - [-1, 1, AIFI, [1024, 8]]                                   # 11
  - [-1, 1, Conv, [256, 1, 1]]                                 # 12
  - [-1, 1, MergeBlockattention, [256]]                        # 13
    # ---------------------------

  - [-1, 1, CARAFE, [256,3,2]]                                 # 14

    # ---------- DBA -----------
  - [7, 1, Conv, [256, 1, 1, None, 1, 1, False]]               # 15
  - [-1, 1, BiFormerBlock, [256]]                              # 16
  - [[-2, -1], 1, Concat, [1]]                                 # 17
  - [-1, 3, RepC3, [256]]                                      # 18
    # ---------------------------

  - [-1, 1, Conv, [256, 1, 1]]                                 # 19
  - [-1, 1, CARAFE, [256,3,2]]                                 # 20

    # ---------- DBA -----------
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]               # 21
  - [-1, 1, BiFormerBlock, [256]]                              # 22
  - [[-2, -1], 1, Concat, [1]]                                 # 23
  - [-1, 3, RepC3, [256]]                                      # 24
    # ---------------------------

    # ---------- DBA -----------
  - [-1, 1, Conv, [256, 3, 2]]                                 # 25
  - [-1, 1, BiFormerBlock, [256]]                              # 26
  - [[-1, 19], 1, Concat, [1]]                                 # 27
  - [-1, 3, RepC3, [256]]                                      # 28
    # ---------------------------

    # ---------- DBA -----------
  - [-1, 1, Conv, [256, 3, 2]]                                 # 29
  - [-1, 1, BiFormerBlock, [256]]                              # 30
  - [[-1, 12], 1, Concat, [1]]                                 # 31
  - [-1, 3, RepC3, [256]]                                      # 32
    # ---------------------------

  - [[24, 28, 32], 1, RTDETRDecoder, [nc]]      # Detect(P3, P4, P5)
